app/controllers/recipes_controller.rb

SELECT * FROM `recipes` WHERE (`recipes`.`id` = 1)
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO `recipes` (`name`, `updated_at`, `type`, `recipe_category_id`, `description`, `created_at`) VALUES('Corn Chowder', '2010-03-21 01:32:31', NULL, 1, 'A hearty, flavorful chowder.', '2010-03-21 01:32:31')
---
  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save