app/controllers/recipe_categories_controller.rb

  def show
    @recipe_category = RecipeCategory.find(params[:id])
---
SELECT * FROM `recipe_categories` WHERE (`recipe_categories`.`id` = 1)

  def edit
    @recipe_category = RecipeCategory.find(params[:id])
---
SELECT * FROM `recipe_categories` WHERE (`recipe_categories`.`id` = 5)

  def create
    @recipe_category = RecipeCategory.new(params[:recipe_category])

    respond_to do |format|
      if @recipe_category.save
---
INSERT INTO `recipe_categories` (`name`, `updated_at`, `description`, `created_at`) VALUES('Soups and Chowders', '2010-03-20 19:54:03', '', '2010-03-20 19:54:03')