app/controllers/temp_emails_controller.rb

SELECT * FROM `temp_emails` WHERE (`temp_emails`.`id` = 1)
---
  def show
    @temp_email = TempEmail.find(params[:id])

SELECT * FROM `temp_emails` WHERE (`temp_emails`.`id` = 1)
---
  def edit
    @temp_email = TempEmail.find(params[:id])

INSERT INTO `temp_emails` (`updated_at`, `address`, `created_at`) VALUES('2010-03-15 03:38:50', 'seth@loriannskitchen.com', '2010-03-15 03:38:50')
---
  def create
    @temp_email = TempEmail.new(params[:temp_email])

    respond_to do |format|
      if @temp_email.save